<?xml version="1.0" ?>
<net name="nsnet2-20ms-baseline" version="10">
	<layers>
		<layer id="0" name="input" type="Parameter" version="opset1">
			<data element_type="f32" shape="1,1000,161"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1000</dim>
					<dim>161</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="MatMul_0/1_port_transpose1590_const" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="400,161" size="257600"/>
			<output>
				<port id="1" precision="FP32">
					<dim>400</dim>
					<dim>161</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="MatMul_0" type="MatMul" version="opset1">
			<data transpose_a="False" transpose_b="True"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1000</dim>
					<dim>161</dim>
				</port>
				<port id="1">
					<dim>400</dim>
					<dim>161</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1000</dim>
					<dim>400</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="onnx_initializer_node_fc_in.0.bias/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="257600" shape="1,1,400" size="1600"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>400</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Add_1" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1000</dim>
					<dim>400</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>400</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1000</dim>
					<dim>400</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Relu_2" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1000</dim>
					<dim>400</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1000</dim>
					<dim>400</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Transpose_9/Cast_12422_const" type="Const" version="opset1">
			<data element_type="i64" offset="259200" shape="3" size="24"/>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Transpose_9" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1000</dim>
					<dim>400</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1000</dim>
					<dim>1</dim>
					<dim>400</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="ConstantOfShape_8/Broadcast/FillValue/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="259224" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="onnx_initializer_node_173/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i64" offset="259228" shape="1" size="8"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Shape_3" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1000</dim>
					<dim>400</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Gather_561/Cast_12432_const" type="Const" version="opset1">
			<data element_type="i32" offset="259224" shape="" size="4"/>
			<output>
				<port id="1" precision="I32"/>
			</output>
		</layer>
		<layer id="12" name="Gather_561/Cast_22434_const" type="Const" version="opset1">
			<data element_type="i64" offset="259236" shape="" size="8"/>
			<output>
				<port id="1" precision="I64"/>
			</output>
		</layer>
		<layer id="13" name="Gather_561" type="Gather" version="opset1">
			<input>
				<port id="0">
					<dim>3</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
			</input>
			<output>
				<port id="3" precision="I64"/>
			</output>
		</layer>
		<layer id="14" name="Unsqueeze_6/Dims/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i64" offset="259236" shape="1" size="8"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Unsqueeze_6/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0"/>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="onnx_initializer_node_174/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i64" offset="259244" shape="1" size="8"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Concat_7" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="ConstantOfShape_8/Broadcast" type="Broadcast" version="opset3">
			<data mode="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>400</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Slice_13/Cast_12426_const" type="Const" version="opset1">
			<data element_type="i64" offset="259252" shape="3" size="24"/>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Slice_13/Cast_22428_const" type="Const" version="opset1">
			<data element_type="i64" offset="259276" shape="3" size="24"/>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Slice_13/Cast_32430_const" type="Const" version="opset1">
			<data element_type="i64" offset="259300" shape="3" size="24"/>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Slice_13" type="StridedSlice" version="opset1">
			<data begin_mask="1,1,1" ellipsis_mask="0,0,0" end_mask="0,1,1" new_axis_mask="0,0,0" shrink_axis_mask="0,0,0"/>
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>1</dim>
					<dim>400</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
				<port id="2">
					<dim>3</dim>
				</port>
				<port id="3">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>400</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="GRU_14/ShapeOf" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0">
					<dim>1000</dim>
					<dim>1</dim>
					<dim>400</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="GRU_14/ShapeOf/Gather/Cast_12416_const" type="Const" version="opset1">
			<data element_type="i32" offset="259324" shape="1" size="4"/>
			<output>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="GRU_14/ShapeOf/Gather/Cast_22418_const" type="Const" version="opset1">
			<data element_type="i64" offset="259236" shape="" size="8"/>
			<output>
				<port id="1" precision="I64"/>
			</output>
		</layer>
		<layer id="26" name="GRU_14/ShapeOf/Gather" type="Gather" version="opset1">
			<input>
				<port id="0">
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="GRU_14/HiddenStateResizeDim/value503_const" type="Const" version="opset1">
			<data element_type="i64" offset="259244" shape="1" size="8"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="GRU_14/HiddenStateResizeDim" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="GRU_14/HiddenStateResize" type="Reshape" version="opset1">
			<data special_zero="True"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>400</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>400</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="GRU_14/TensorIterator" type="TensorIterator" version="opset1">
			<input>
				<port id="0">
					<dim>1000</dim>
					<dim>1</dim>
					<dim>400</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>400</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1000</dim>
					<dim>1</dim>
					<dim>400</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>400</dim>
				</port>
			</output>
			<port_map>
				<input external_port_id="1" internal_layer_id="3"/>
				<input axis="0" external_port_id="0" internal_layer_id="0" part_size="1" stride="1"/>
				<output axis="0" external_port_id="2" internal_layer_id="11" part_size="1" stride="1"/>
				<output external_port_id="3" internal_layer_id="8"/>
			</port_map>
			<back_edges>
				<edge from-layer="8" to-layer="3"/>
			</back_edges>
			<body>
				<layers>
					<layer id="0" name="17" type="Parameter" version="opset1">
						<data element_type="f32" shape="1,1,400"/>
						<output>
							<port id="0" precision="FP32">
								<dim>1</dim>
								<dim>1</dim>
								<dim>400</dim>
							</port>
						</output>
					</layer>
					<layer id="1" name="6_const" type="Const" version="opset1">
						<data element_type="i64" offset="259236" shape="1" size="8"/>
						<output>
							<port id="1" precision="I64">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="2" name="GRU_14/input_squeeze" type="Squeeze" version="opset1">
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>1</dim>
								<dim>400</dim>
							</port>
							<port id="1">
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP32">
								<dim>1</dim>
								<dim>400</dim>
							</port>
						</output>
					</layer>
					<layer id="3" name="19" type="Parameter" version="opset1">
						<data element_type="f32" shape="1,400"/>
						<output>
							<port id="0" precision="FP32">
								<dim>1</dim>
								<dim>400</dim>
							</port>
						</output>
					</layer>
					<layer id="4" name="GRU_14/GRUCell/Split224_const" type="Const" version="opset1">
						<data element_type="f32" offset="3051204" shape="1200,400" size="1920000"/>
						<output>
							<port id="1" precision="FP32">
								<dim>1200</dim>
								<dim>400</dim>
							</port>
						</output>
					</layer>
					<layer id="5" name="GRU_14/GRUCell/Split225_const" type="Const" version="opset1">
						<data element_type="f32" offset="4971204" shape="1200,400" size="1920000"/>
						<output>
							<port id="1" precision="FP32">
								<dim>1200</dim>
								<dim>400</dim>
							</port>
						</output>
					</layer>
					<layer id="6" name="GRU_14/inport/2_const" type="Const" version="opset1">
						<data element_type="f32" offset="6891204" shape="1600" size="6400"/>
						<output>
							<port id="1" precision="FP32">
								<dim>1600</dim>
							</port>
						</output>
					</layer>
					<layer id="7" name="GRU_14/GRUCell" type="GRUCell" version="opset3">
						<data hidden_size="400" linear_before_reset="1"/>
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>400</dim>
							</port>
							<port id="1">
								<dim>1</dim>
								<dim>400</dim>
							</port>
							<port id="2">
								<dim>1200</dim>
								<dim>400</dim>
							</port>
							<port id="3">
								<dim>1200</dim>
								<dim>400</dim>
							</port>
							<port id="4">
								<dim>1600</dim>
							</port>
						</input>
						<output>
							<port id="5" precision="FP32">
								<dim>1</dim>
								<dim>400</dim>
							</port>
						</output>
					</layer>
					<layer id="8" name="GRU_14/outport/0/sink_port_0" type="Result" version="opset1">
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>400</dim>
							</port>
						</input>
					</layer>
					<layer id="9" name="12_const" type="Const" version="opset1">
						<data element_type="i64" offset="259236" shape="1" size="8"/>
						<output>
							<port id="1" precision="I64">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="10" name="GRU_14/output_unsqueeze/" type="Unsqueeze" version="opset1">
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>400</dim>
							</port>
							<port id="1">
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP32">
								<dim>1</dim>
								<dim>1</dim>
								<dim>400</dim>
							</port>
						</output>
					</layer>
					<layer id="11" name="15/sink_port_0" type="Result" version="opset1">
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>1</dim>
								<dim>400</dim>
							</port>
						</input>
					</layer>
				</layers>
				<edges>
					<edge from-layer="0" from-port="0" to-layer="2" to-port="0"/>
					<edge from-layer="1" from-port="1" to-layer="2" to-port="1"/>
					<edge from-layer="2" from-port="2" to-layer="7" to-port="0"/>
					<edge from-layer="3" from-port="0" to-layer="7" to-port="1"/>
					<edge from-layer="4" from-port="1" to-layer="7" to-port="2"/>
					<edge from-layer="5" from-port="1" to-layer="7" to-port="3"/>
					<edge from-layer="6" from-port="1" to-layer="7" to-port="4"/>
					<edge from-layer="7" from-port="5" to-layer="8" to-port="0"/>
					<edge from-layer="7" from-port="5" to-layer="10" to-port="0"/>
					<edge from-layer="9" from-port="1" to-layer="10" to-port="1"/>
					<edge from-layer="10" from-port="2" to-layer="11" to-port="0"/>
				</edges>
			</body>
		</layer>
		<layer id="31" name="491_const" type="Const" version="opset1">
			<data element_type="i64" offset="259236" shape="1" size="8"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="GRU_14/UnsqueezeNumDirections/1" type="Unsqueeze" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>400</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>400</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="GRU_14/ExtraOutput/1/sink_port_0" type="Result" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>400</dim>
				</port>
			</input>
		</layer>
		<layer id="34" name="487_const" type="Const" version="opset1">
			<data element_type="i64" offset="259328" shape="1" size="8"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="GRU_14/UnsqueezeNumDirections/0" type="Unsqueeze" version="opset1">
			<input>
				<port id="0">
					<dim>1000</dim>
					<dim>1</dim>
					<dim>400</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1000</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>400</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Squeeze_15/Dims/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i64" offset="259328" shape="1" size="8"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Squeeze_15" type="Squeeze" version="opset1">
			<input>
				<port id="0">
					<dim>1000</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>400</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1000</dim>
					<dim>1</dim>
					<dim>400</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Slice_19/Cast_12440_const" type="Const" version="opset1">
			<data element_type="i64" offset="259276" shape="3" size="24"/>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Slice_19/Cast_22442_const" type="Const" version="opset1">
			<data element_type="i64" offset="259336" shape="3" size="24"/>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Slice_19/Cast_32444_const" type="Const" version="opset1">
			<data element_type="i64" offset="259300" shape="3" size="24"/>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Slice_19" type="StridedSlice" version="opset1">
			<data begin_mask="0,1,1" ellipsis_mask="0,0,0" end_mask="0,1,1" new_axis_mask="0,0,0" shrink_axis_mask="0,0,0"/>
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>1</dim>
					<dim>400</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
				<port id="2">
					<dim>3</dim>
				</port>
				<port id="3">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>400</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="GRU_20/ShapeOf" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0">
					<dim>1000</dim>
					<dim>1</dim>
					<dim>400</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="GRU_20/ShapeOf/Gather/Cast_12436_const" type="Const" version="opset1">
			<data element_type="i32" offset="259324" shape="1" size="4"/>
			<output>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="GRU_20/ShapeOf/Gather/Cast_22438_const" type="Const" version="opset1">
			<data element_type="i64" offset="259236" shape="" size="8"/>
			<output>
				<port id="1" precision="I64"/>
			</output>
		</layer>
		<layer id="45" name="GRU_20/ShapeOf/Gather" type="Gather" version="opset1">
			<input>
				<port id="0">
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="GRU_20/HiddenStateResizeDim/value479_const" type="Const" version="opset1">
			<data element_type="i64" offset="259244" shape="1" size="8"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="GRU_20/HiddenStateResizeDim" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="GRU_20/HiddenStateResize" type="Reshape" version="opset1">
			<data special_zero="True"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>400</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>400</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="GRU_20/TensorIterator" type="TensorIterator" version="opset1">
			<input>
				<port id="0">
					<dim>1000</dim>
					<dim>1</dim>
					<dim>400</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>400</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1000</dim>
					<dim>1</dim>
					<dim>400</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>400</dim>
				</port>
			</output>
			<port_map>
				<input external_port_id="1" internal_layer_id="3"/>
				<input axis="0" external_port_id="0" internal_layer_id="0" part_size="1" stride="1"/>
				<output axis="0" external_port_id="2" internal_layer_id="11" part_size="1" stride="1"/>
				<output external_port_id="3" internal_layer_id="8"/>
			</port_map>
			<back_edges>
				<edge from-layer="8" to-layer="3"/>
			</back_edges>
			<body>
				<layers>
					<layer id="0" name="17" type="Parameter" version="opset1">
						<data element_type="f32" shape="1,1,400"/>
						<output>
							<port id="0" precision="FP32">
								<dim>1</dim>
								<dim>1</dim>
								<dim>400</dim>
							</port>
						</output>
					</layer>
					<layer id="1" name="6_const" type="Const" version="opset1">
						<data element_type="i64" offset="259236" shape="1" size="8"/>
						<output>
							<port id="1" precision="I64">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="2" name="GRU_20/input_squeeze" type="Squeeze" version="opset1">
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>1</dim>
								<dim>400</dim>
							</port>
							<port id="1">
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP32">
								<dim>1</dim>
								<dim>400</dim>
							</port>
						</output>
					</layer>
					<layer id="3" name="19" type="Parameter" version="opset1">
						<data element_type="f32" shape="1,400"/>
						<output>
							<port id="0" precision="FP32">
								<dim>1</dim>
								<dim>400</dim>
							</port>
						</output>
					</layer>
					<layer id="4" name="GRU_20/GRUCell/Split224_const" type="Const" version="opset1">
						<data element_type="f32" offset="6897604" shape="1200,400" size="1920000"/>
						<output>
							<port id="1" precision="FP32">
								<dim>1200</dim>
								<dim>400</dim>
							</port>
						</output>
					</layer>
					<layer id="5" name="GRU_20/GRUCell/Split225_const" type="Const" version="opset1">
						<data element_type="f32" offset="8817604" shape="1200,400" size="1920000"/>
						<output>
							<port id="1" precision="FP32">
								<dim>1200</dim>
								<dim>400</dim>
							</port>
						</output>
					</layer>
					<layer id="6" name="GRU_20/inport/2_const" type="Const" version="opset1">
						<data element_type="f32" offset="10737604" shape="1600" size="6400"/>
						<output>
							<port id="1" precision="FP32">
								<dim>1600</dim>
							</port>
						</output>
					</layer>
					<layer id="7" name="GRU_20/GRUCell" type="GRUCell" version="opset3">
						<data hidden_size="400" linear_before_reset="1"/>
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>400</dim>
							</port>
							<port id="1">
								<dim>1</dim>
								<dim>400</dim>
							</port>
							<port id="2">
								<dim>1200</dim>
								<dim>400</dim>
							</port>
							<port id="3">
								<dim>1200</dim>
								<dim>400</dim>
							</port>
							<port id="4">
								<dim>1600</dim>
							</port>
						</input>
						<output>
							<port id="5" precision="FP32">
								<dim>1</dim>
								<dim>400</dim>
							</port>
						</output>
					</layer>
					<layer id="8" name="GRU_20/outport/0/sink_port_0" type="Result" version="opset1">
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>400</dim>
							</port>
						</input>
					</layer>
					<layer id="9" name="12_const" type="Const" version="opset1">
						<data element_type="i64" offset="259236" shape="1" size="8"/>
						<output>
							<port id="1" precision="I64">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="10" name="GRU_20/output_unsqueeze/" type="Unsqueeze" version="opset1">
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>400</dim>
							</port>
							<port id="1">
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP32">
								<dim>1</dim>
								<dim>1</dim>
								<dim>400</dim>
							</port>
						</output>
					</layer>
					<layer id="11" name="15/sink_port_0" type="Result" version="opset1">
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>1</dim>
								<dim>400</dim>
							</port>
						</input>
					</layer>
				</layers>
				<edges>
					<edge from-layer="0" from-port="0" to-layer="2" to-port="0"/>
					<edge from-layer="1" from-port="1" to-layer="2" to-port="1"/>
					<edge from-layer="2" from-port="2" to-layer="7" to-port="0"/>
					<edge from-layer="3" from-port="0" to-layer="7" to-port="1"/>
					<edge from-layer="4" from-port="1" to-layer="7" to-port="2"/>
					<edge from-layer="5" from-port="1" to-layer="7" to-port="3"/>
					<edge from-layer="6" from-port="1" to-layer="7" to-port="4"/>
					<edge from-layer="7" from-port="5" to-layer="8" to-port="0"/>
					<edge from-layer="7" from-port="5" to-layer="10" to-port="0"/>
					<edge from-layer="9" from-port="1" to-layer="10" to-port="1"/>
					<edge from-layer="10" from-port="2" to-layer="11" to-port="0"/>
				</edges>
			</body>
		</layer>
		<layer id="50" name="467_const" type="Const" version="opset1">
			<data element_type="i64" offset="259236" shape="1" size="8"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="GRU_20/UnsqueezeNumDirections/1" type="Unsqueeze" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>400</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>400</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="GRU_20/ExtraOutput/1/sink_port_0" type="Result" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>400</dim>
				</port>
			</input>
		</layer>
		<layer id="53" name="463_const" type="Const" version="opset1">
			<data element_type="i64" offset="259328" shape="1" size="8"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="GRU_20/UnsqueezeNumDirections/0" type="Unsqueeze" version="opset1">
			<input>
				<port id="0">
					<dim>1000</dim>
					<dim>1</dim>
					<dim>400</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1000</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>400</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Squeeze_21/Dims/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i64" offset="259328" shape="1" size="8"/>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Squeeze_21" type="Squeeze" version="opset1">
			<input>
				<port id="0">
					<dim>1000</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>400</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1000</dim>
					<dim>1</dim>
					<dim>400</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Transpose_22/Cast_12424_const" type="Const" version="opset1">
			<data element_type="i64" offset="259200" shape="3" size="24"/>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Transpose_22" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>1000</dim>
					<dim>1</dim>
					<dim>400</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1000</dim>
					<dim>400</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="MatMul_23/1_port_transpose1594_const" type="Const" version="opset1">
			<data element_type="f32" offset="259360" shape="600,400" size="960000"/>
			<output>
				<port id="1" precision="FP32">
					<dim>600</dim>
					<dim>400</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="MatMul_23" type="MatMul" version="opset1">
			<data transpose_a="False" transpose_b="True"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1000</dim>
					<dim>400</dim>
				</port>
				<port id="1">
					<dim>600</dim>
					<dim>400</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1000</dim>
					<dim>600</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="onnx_initializer_node_fc_out.0.bias/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="1219360" shape="1,1,600" size="2400"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>600</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Add_24" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1000</dim>
					<dim>600</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>600</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1000</dim>
					<dim>600</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Relu_25" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1000</dim>
					<dim>600</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1000</dim>
					<dim>600</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="MatMul_26/1_port_transpose1586_const" type="Const" version="opset1">
			<data element_type="f32" offset="1221760" shape="600,600" size="1440000"/>
			<output>
				<port id="1" precision="FP32">
					<dim>600</dim>
					<dim>600</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="MatMul_26" type="MatMul" version="opset1">
			<data transpose_a="False" transpose_b="True"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1000</dim>
					<dim>600</dim>
				</port>
				<port id="1">
					<dim>600</dim>
					<dim>600</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1000</dim>
					<dim>600</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="onnx_initializer_node_fc_out.2.bias/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="2661760" shape="1,1,600" size="2400"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>600</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Add_27" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1000</dim>
					<dim>600</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>600</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1000</dim>
					<dim>600</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Relu_28" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1000</dim>
					<dim>600</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1000</dim>
					<dim>600</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="MatMul_29/1_port_transpose1598_const" type="Const" version="opset1">
			<data element_type="f32" offset="2664160" shape="161,600" size="386400"/>
			<output>
				<port id="1" precision="FP32">
					<dim>161</dim>
					<dim>600</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="MatMul_29" type="MatMul" version="opset1">
			<data transpose_a="False" transpose_b="True"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1000</dim>
					<dim>600</dim>
				</port>
				<port id="1">
					<dim>161</dim>
					<dim>600</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1000</dim>
					<dim>161</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="onnx_initializer_node_fc_out.4.bias/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="3050560" shape="1,1,161" size="644"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>161</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Add_30" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1000</dim>
					<dim>161</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>161</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1000</dim>
					<dim>161</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="output" type="Sigmoid" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1000</dim>
					<dim>161</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1000</dim>
					<dim>161</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="output/sink_port_0" type="Result" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1000</dim>
					<dim>161</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="2" to-port="0"/>
		<edge from-layer="1" from-port="1" to-layer="2" to-port="1"/>
		<edge from-layer="2" from-port="2" to-layer="4" to-port="0"/>
		<edge from-layer="3" from-port="1" to-layer="4" to-port="1"/>
		<edge from-layer="4" from-port="2" to-layer="5" to-port="0"/>
		<edge from-layer="5" from-port="1" to-layer="7" to-port="0"/>
		<edge from-layer="6" from-port="1" to-layer="7" to-port="1"/>
		<edge from-layer="5" from-port="1" to-layer="10" to-port="0"/>
		<edge from-layer="10" from-port="1" to-layer="13" to-port="0"/>
		<edge from-layer="11" from-port="1" to-layer="13" to-port="1"/>
		<edge from-layer="12" from-port="1" to-layer="13" to-port="2"/>
		<edge from-layer="13" from-port="3" to-layer="15" to-port="0"/>
		<edge from-layer="14" from-port="1" to-layer="15" to-port="1"/>
		<edge from-layer="9" from-port="1" to-layer="17" to-port="0"/>
		<edge from-layer="15" from-port="2" to-layer="17" to-port="1"/>
		<edge from-layer="16" from-port="1" to-layer="17" to-port="2"/>
		<edge from-layer="8" from-port="1" to-layer="18" to-port="0"/>
		<edge from-layer="17" from-port="3" to-layer="18" to-port="1"/>
		<edge from-layer="18" from-port="2" to-layer="22" to-port="0"/>
		<edge from-layer="19" from-port="1" to-layer="22" to-port="1"/>
		<edge from-layer="20" from-port="1" to-layer="22" to-port="2"/>
		<edge from-layer="21" from-port="1" to-layer="22" to-port="3"/>
		<edge from-layer="7" from-port="2" to-layer="23" to-port="0"/>
		<edge from-layer="23" from-port="1" to-layer="26" to-port="0"/>
		<edge from-layer="24" from-port="1" to-layer="26" to-port="1"/>
		<edge from-layer="25" from-port="1" to-layer="26" to-port="2"/>
		<edge from-layer="26" from-port="3" to-layer="28" to-port="0"/>
		<edge from-layer="27" from-port="1" to-layer="28" to-port="1"/>
		<edge from-layer="22" from-port="4" to-layer="29" to-port="0"/>
		<edge from-layer="28" from-port="2" to-layer="29" to-port="1"/>
		<edge from-layer="7" from-port="2" to-layer="30" to-port="0"/>
		<edge from-layer="29" from-port="2" to-layer="30" to-port="1"/>
		<edge from-layer="30" from-port="3" to-layer="32" to-port="0"/>
		<edge from-layer="31" from-port="1" to-layer="32" to-port="1"/>
		<edge from-layer="32" from-port="2" to-layer="33" to-port="0"/>
		<edge from-layer="30" from-port="2" to-layer="35" to-port="0"/>
		<edge from-layer="34" from-port="1" to-layer="35" to-port="1"/>
		<edge from-layer="35" from-port="2" to-layer="37" to-port="0"/>
		<edge from-layer="36" from-port="1" to-layer="37" to-port="1"/>
		<edge from-layer="18" from-port="2" to-layer="41" to-port="0"/>
		<edge from-layer="38" from-port="1" to-layer="41" to-port="1"/>
		<edge from-layer="39" from-port="1" to-layer="41" to-port="2"/>
		<edge from-layer="40" from-port="1" to-layer="41" to-port="3"/>
		<edge from-layer="37" from-port="2" to-layer="42" to-port="0"/>
		<edge from-layer="42" from-port="1" to-layer="45" to-port="0"/>
		<edge from-layer="43" from-port="1" to-layer="45" to-port="1"/>
		<edge from-layer="44" from-port="1" to-layer="45" to-port="2"/>
		<edge from-layer="45" from-port="3" to-layer="47" to-port="0"/>
		<edge from-layer="46" from-port="1" to-layer="47" to-port="1"/>
		<edge from-layer="41" from-port="4" to-layer="48" to-port="0"/>
		<edge from-layer="47" from-port="2" to-layer="48" to-port="1"/>
		<edge from-layer="37" from-port="2" to-layer="49" to-port="0"/>
		<edge from-layer="48" from-port="2" to-layer="49" to-port="1"/>
		<edge from-layer="49" from-port="3" to-layer="51" to-port="0"/>
		<edge from-layer="50" from-port="1" to-layer="51" to-port="1"/>
		<edge from-layer="51" from-port="2" to-layer="52" to-port="0"/>
		<edge from-layer="49" from-port="2" to-layer="54" to-port="0"/>
		<edge from-layer="53" from-port="1" to-layer="54" to-port="1"/>
		<edge from-layer="54" from-port="2" to-layer="56" to-port="0"/>
		<edge from-layer="55" from-port="1" to-layer="56" to-port="1"/>
		<edge from-layer="56" from-port="2" to-layer="58" to-port="0"/>
		<edge from-layer="57" from-port="1" to-layer="58" to-port="1"/>
		<edge from-layer="58" from-port="2" to-layer="60" to-port="0"/>
		<edge from-layer="59" from-port="1" to-layer="60" to-port="1"/>
		<edge from-layer="60" from-port="2" to-layer="62" to-port="0"/>
		<edge from-layer="61" from-port="1" to-layer="62" to-port="1"/>
		<edge from-layer="62" from-port="2" to-layer="63" to-port="0"/>
		<edge from-layer="63" from-port="1" to-layer="65" to-port="0"/>
		<edge from-layer="64" from-port="1" to-layer="65" to-port="1"/>
		<edge from-layer="65" from-port="2" to-layer="67" to-port="0"/>
		<edge from-layer="66" from-port="1" to-layer="67" to-port="1"/>
		<edge from-layer="67" from-port="2" to-layer="68" to-port="0"/>
		<edge from-layer="68" from-port="1" to-layer="70" to-port="0"/>
		<edge from-layer="69" from-port="1" to-layer="70" to-port="1"/>
		<edge from-layer="70" from-port="2" to-layer="72" to-port="0"/>
		<edge from-layer="71" from-port="1" to-layer="72" to-port="1"/>
		<edge from-layer="72" from-port="2" to-layer="73" to-port="0"/>
		<edge from-layer="73" from-port="1" to-layer="74" to-port="0"/>
	</edges>
	<meta_data>
		<MO_version value="unknown version"/>
		<cli_parameters>
			<caffe_parser_path value="DIR"/>
			<data_type value="float"/>
			<disable_nhwc_to_nchw value="False"/>
			<disable_omitting_optional value="False"/>
			<disable_resnet_optimization value="False"/>
			<disable_weights_compression value="False"/>
			<enable_concat_optimization value="False"/>
			<enable_flattening_nested_params value="False"/>
			<enable_ssd_gluoncv value="False"/>
			<extensions value="DIR"/>
			<framework value="onnx"/>
			<freeze_placeholder_with_value value="{}"/>
			<generate_deprecated_IR_V7 value="False"/>
			<input_model value="DIR/nsnet2-20ms-baseline.onnx"/>
			<input_model_is_text value="False"/>
			<input_shape value="[1,1000,161]"/>
			<k value="DIR/CustomLayersMapping.xml"/>
			<keep_shape_ops value="True"/>
			<legacy_mxnet_model value="False"/>
			<log_level value="ERROR"/>
			<mean_scale_values value="{}"/>
			<mean_values value="()"/>
			<model_name value="nsnet2-20ms-baseline"/>
			<output_dir value="DIR"/>
			<placeholder_data_types value="{}"/>
			<placeholder_shapes value="[   1 1000  161]"/>
			<progress value="False"/>
			<remove_memory value="False"/>
			<remove_output_softmax value="False"/>
			<reverse_input_channels value="False"/>
			<save_params_from_nd value="False"/>
			<scale_values value="()"/>
			<silent value="False"/>
			<static_shape value="False"/>
			<stream_output value="False"/>
			<unset unset_cli_parameters="batch, counts, disable_fusing, disable_gfusing, finegrain_fusing, input, input_checkpoint, input_meta_graph, input_proto, input_symbol, mean_file, mean_file_offsets, move_to_preprocess, nd_prefix_name, output, pretrained_model_name, saved_model_dir, saved_model_tags, scale, tensorboard_logdir, tensorflow_custom_layer_libraries, tensorflow_custom_operations_config_update, tensorflow_object_detection_api_pipeline_config, tensorflow_use_custom_operations_config, transformations_config"/>
		</cli_parameters>
	</meta_data>
</net>
